/*1. Напишите команду,
которая выведет все документы из коллекции student.*/

db.student.find().pretty()

/*2. Напишите команду,
которая выведет все документы из коллекции student,
в которых значение по ключу "name" равно "Anna".*/

db.student.find({name:"Anna"})

/*3. Напишите команду,
которая выведет все документы из коллекции student,
в которых значение по ключу "name" равно "Anna",
а значение ключа "age" — 25.*/

db.student.find({name:"Anna", age:25})

/*4. Напишите команду,
которая выведет все документы из коллекции student,
в которых в значениях по ключу surname встречается
вхождение подстроки ova.*/

db.student.find({surname:/ova/})